🚀&nbsp; env0 had composed a PR Plan for environment [Triggered Env Plugin / env0-playground simple-tf ](https://app.env0.com/p/8ecd5554-fae1-439a-a789-33f005657861/environments/eb80fd99-4d5b-4c54-b4af-607e374e39fc):
```
Plan: 1 to add, 0 to change, 1 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

OpenTofu will perform the following actions:


  # random_string.random must be replaced
-/+ resource "random_string" "random" {
!       id          = "NO4zi" -> (known after apply)
!       result      = "NO4zi" -> (known after apply)
!       special     = false -> true # forces replacement
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!   random_string = "NO4zi" -> (known after apply)
```
</details>


```
Failed to calculate cost estimation
```


[Full PR Plan logs on env0](https://app.env0.com/p/8ecd5554-fae1-439a-a789-33f005657861/environments/eb80fd99-4d5b-4c54-b4af-607e374e39fc/deployments/4a01371d-d589-414d-a899-d4bccfc59b11)